src/Catalogs/Banks.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Banks</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ServiceID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Icon</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Logotype</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateUpdatedUTC</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IconUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Banks/Forms/ItemForm/Ext/Form/Module.bsl
&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	DateUpdatedLocalTime = ToLOcalTime(Object.DateUpdatedUTC);
	CatalogObject = FormAttributeToValue("Object");
	If ValueIsFilled(CatalogObject.Logotype.Get()) Then
		LogotypeAddress = GetURL(CatalogObject, "Logotype");
		Items.Logotype.PictureSize = PictureSize.Proportionally;
		Items.Logotype.Width = 12;
		Items.Logotype.Height = 4;
	ElsIf ValueIsFilled(CatalogObject.Icon.Get()) Then
		LogotypeAddress = GetURL(CatalogObject, "Icon");
		Items.Logotype.PictureSize = PictureSize.RealSize;
		Items.Logotype.Width = 6;
		Items.Logotype.Height = 2;
	Else		
		LogotypeAddress = "";
	EndIf;
	If Not ValueIsFilled(LogotypeAddress) Then
		Items.Logotype.Visible = False;
	EndIf;

EndProcedure

&AtClient
Procedure ServiceURLClick(Item, StandardProcessing)
	StandardProcessing = false;
	If ValueIsFilled(Object.ServiceURL) Then
		GotoUrl(Object.ServiceURL);
	EndIf;
EndProcedure
